---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.PatternApplication
source: html/6cf128e9-3aa8-84f8-c5f3-0ac281a8bf53.htm
---
# Autodesk.Revit.DB.GroupTypeId.PatternApplication Property

Pattern Application.

## Syntax (C#)
```csharp
public static ForgeTypeId PatternApplication { get; }
```